
<title>Процессоры</title>
<main>
  <h1>Главная</h1>

</main>
<!-- App.svelte -->
<script>
  import ProductCard from './ProductCard.svelte';

  // Данные о товарах
  let products = [
    {
      id: "Процессор Ryzen 3 3200g",
      name: 'Процессор Ryzen 3 3200g',
      price: "7999 р",
      description: 'Описание товара:Ryzen 3 3200G - десктопный процессор от компании AMD для сокета AM4, который имеет 4 ядра и 4 потока. Его базовая частота – 3600 МГц, но поддержка технологии Turbo Core позволяет автоматически разгоняться до 4000 МГц. Данный чип имеет интегрированную графику Radeon Vega 8, а размер кэша 3-го уровня составляет 4 МБ. Cinebench R23 (одноядерный).',
    },
    {
      id: "Intel Core I5-10400F",
      name: 'Intel Core I5-10400F',
      price: "9500 р",
      description:'Описание товара:Intel Core i5 10400F - десктопный процессор от компании Intel для сокета BGA-1200, который имеет 6 ядер и 12 потоков. Его базовая частота – 2900 МГц, но поддержка технологии Turbo Boost позволяет автоматически разгоняться до 4300 МГц. Данный чип не имеет интегрированной графики, а размер кэша 3-го уровня составляет 12 МБ. Cinebench R23 (одноядерный) 1108. Cinebench R23 (многоядерный) 7587',
    },
    {
      id:"Intel Core i3 10100F",
      name: 'Intel Core i3 10100F',
      price: "6099 р",
      description: 'Описание товара:Intel Core i3 10100F - десктопный процессор от компании Intel для сокета LGA-1200, который имеет 4 ядра и 8 потоков. Его базовая частота – 3600 МГц, но поддержка технологии Turbo Boost позволяет автоматически разгоняться до 4300 МГц. Данный чип не имеет интегрированной графики, а размер кэша 3-го уровня составляет 6 МБ. Cinebench R23 (одноядерный) 1137. Cinebench R23 (многоядерный) 5573. Passmark CPU (одноядерный) 2587.',
    },
    {
      id:"Ryzeb 5 5600",
      name: 'Ryzeb 5 5600',
      price: "11999 р",
      description: 'Ryzen 5 5600 - десктопный процессор от компании AMD для сокета AM4, который имеет 6 ядер и 12 потоков. Его базовая частота – 3500 МГц, но поддержка технологии Turbo Core позволяет автоматически разгоняться до 4400 МГц. Данный чип не имеет интегрированной графики, а размер кэша 3-го уровня составляет 32 МБ. AMD 15 марта 2022 Десктопный x86-64 Vermeer AM4. Нет 6 12 3.5 ГГц 4.4 ГГц 100 МГц 35x 64КБ (на ядро) 512КБ (на ядро) 32МБ (общий).',
    }
  ];

  function handleBuy(event) {
    alert(`Товар  ${event.detail.id} добавлен в корзину!`);
  }
</script>

<main>
  {#each products as product}
    <ProductCard {product} on:buy={handleBuy} />
  {/each}
</main>

<style>
  main {
    display: flex;
    flex-wrap: wrap;
    justify-content: space-around;
    font-family: cursive ;
    color: rgb(0, 255, 242);
  }
</style>
