<title>Что такое процессор</title>
<h1>Что такое процессор</h1>
<h2>Что такое процессор</h2>
<p>

    Процессор — это основной вычислительный элемент и «мозг» компьютера, от которого во многом зависит скорость его работы и производительность. Раньше при сборке нового компьютера процессор выбирали первым, а уже потом остальные компоненты, чтобы технические характеристики оборудования совпали. В последнее время процессор чаще берут уже после материнской платы — с заделом на последующий апгрейд.
</p>